{
   "class_name": "Model",
   "config": {
      "name": "model_1",
      "input_layers": [
         [
            "input_1",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "activation_71",
            0,
            0
         ]
      ],
      "layers": [
         {
            "class_name": "InputLayer",
            "name": "input_1",
            "config": {
               "name": "input_1",
               "batch_input_shape": [
                  null,
                  224,
                  224,
                  3
               ],
               "sparse": false,
               "dtype": "float32"
            },
            "inbound_nodes": []
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_1",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_1",
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 48,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "input_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_1",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_1",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_1",
            "config": {
               "name": "activation_1",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_2",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_2",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_1",
            "config": {
               "name": "dropout_1",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_2",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_2",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_2",
            "config": {
               "name": "activation_2",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_3",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_3",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_2",
            "config": {
               "name": "dropout_2",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_3",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_3",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_3",
            "config": {
               "name": "activation_3",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_4",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_4",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_3",
            "config": {
               "name": "dropout_3",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_4",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_4",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_4",
            "config": {
               "name": "activation_4",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_5",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_5",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_4",
            "config": {
               "name": "dropout_4",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_5",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_5",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_5",
            "config": {
               "name": "activation_5",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_6",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_6",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_5",
            "config": {
               "name": "dropout_5",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_6",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_6",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_6",
            "config": {
               "name": "activation_6",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_7",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  1,
                  1
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_7",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 58,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_6",
            "config": {
               "name": "dropout_6",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling2D",
            "name": "max_pooling2d_1",
            "config": {
               "strides": [
                  2,
                  2
               ],
               "padding": "valid",
               "pool_size": [
                  2,
                  2
               ],
               "name": "max_pooling2d_1",
               "data_format": "channels_last",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_7",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_7",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "max_pooling2d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_7",
            "config": {
               "name": "activation_7",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_8",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_8",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 68,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_7",
            "config": {
               "name": "dropout_7",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_8",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_8",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_8",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_8",
            "config": {
               "name": "activation_8",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_8",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_9",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_9",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 68,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_8",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_8",
            "config": {
               "name": "dropout_8",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_9",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_9",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_8",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_9",
            "config": {
               "name": "activation_9",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_10",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_10",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 68,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_9",
            "config": {
               "name": "dropout_9",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_10",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_10",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_10",
            "config": {
               "name": "activation_10",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_11",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_11",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 68,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_10",
            "config": {
               "name": "dropout_10",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_11",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_11",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               }
            },
            "inbound_nodes": [
               [
                  [
                     "dropout_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "name": "activation_11",
            "config": {
               "name": "activation_11",
               "activation": "relu",
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv2D",
            "name": "conv2d_12",
            "config": {
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "seed": null,
                     "mode": "fan_in",
                     "distribution": "uniform"
                  }
               },
               "kernel_size": [
                  3,
                  3
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "conv2d_12",
               "kernel_regularizer": null,
               "strides": [
                  1,
                  1
               ],
               "activity_regularizer": null,
               "padding": "same",
               "bias_regularizer": null,
               "filters": 68,
               "activation": "linear",
               "kernel_constraint": null,
               "use_bias": true,
               "bias_constraint": null,
               "trainable": true,
               "data_format": "channels_last"
            },
            "inbound_nodes": [
               [
                  [
                     "activation_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "name": "dropout_11",
            "config": {
               "name": "dropout_11",
               "rate": 0.2,
               "trainable": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_12",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "name": "batch_normalization_12",
            "config": {
               "axis": 3,
               "center": true,
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_12",
               "momentum": 0.99,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "trainable": true,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "scale": true,
               "gamma_constraint": null,
               "epsilon": 0.001,
               "beta_regularizer": {
                  "class_name": "L1L2",
